@echo off
chcp 65001 >nul
echo =======================================================
echo Запуск локального сервера Склад
echo =======================================================
echo.

echo Проверка наличия Python...
python --version
IF %ERRORLEVEL% NEQ 0 (
    echo.
    echo --------------------------------------------------------
    echo ВНИМАНИЕ: Python не установлен либо не добавлен в PATH! 
    echo Без него локальный сервер работать не будет.
    echo.
    echo ЧТО ДЕЛАТЬ:
    echo 1. Зайдите на сайт https://www.python.org/downloads/
    echo 2. Скачайте последнюю версию для Windows
    echo 3. При установке ОБЯЗАТЕЛЬНО ПОСТАВЬТЕ ГАЛОЧКУ "Add Python to PATH" (в самом низу окна установки)
    echo 4. После установки закройте это окно и запустите скрипт заново.
    echo --------------------------------------------------------
    echo.
    pause
    exit /b
)

echo.
echo Установка необходимых библиотек (Flask)...
python -m pip install -r requirements.txt > error_log.txt 2>&1

echo.
echo Запуск программы...
echo =======================================================
echo Откройте в вашем браузере адрес: http://127.0.0.1:5000
echo Для остановки сервера закройте это окно.
echo =======================================================
echo.
timeout /t 2 >nul
start http://127.0.0.1:5000
python app.py

echo.
echo --------------------------------------------------------
echo СЕРВЕР ЗАВЕРШИЛ РАБОТУ.
echo --------------------------------------------------------

pause
